#+title: Suicide and politics
#+author: Louis James
#+description: Data, Visualisation and the Web, Individual project
#+date: 2019:12:10
#+options: h:2 num:nil toc:nil \n:t
#+LATEX_HEADER: \setlength{\parindent}{0pt}
#+LATEX_HEADER: \usepackage[margin=0.6in]{geometry}

* Setup and imports                                                :noexport:

#+begin_src jupyter-python :session jupyter-python 
# Imports
import numpy as np
import pandas as pd
import matplotlib as mpl
from matplotlib import cm
import matplotlib.pyplot as plt
from pandas.api.types import CategoricalDtype
import seaborn as sns
from scipy import stats
#+end_src

#+RESULTS:
:RESULTS:
# [goto error]
: 
: ImportErrorTraceback (most recent call last)
: <ipython-input-17-6e14f915433f> in <module>()
:       1 # Imports
:       2 import numpy as np
: ----> 3 import pandas as pd
:       4 import matplotlib as mpl
:       5 from matplotlib import cm
: 
: ImportError: No module named pandas
:END:

#+begin_src jupyter-python :session jupyter-python
%matplotlib inline
%config InlineBackend.figure_formats = set(['png']) # or png (and set dpi below)
mpl.rcParams['figure.dpi'] = 100
#+end_src

#+RESULTS:

#+begin_src jupyter-python :session jupyter-python
df = pd.read_csv("../data/politics-and-death/main-merged-data.csv")
# Convert 'year' variable to datetime format
df['year'] = df['year'].astype('str')
df['year'] = pd.to_datetime(df['year'], format='%Y')
# Set 'year' as index
df.set_index('year', inplace=True )
df = df.to_period('D')
df.sort_index(inplace=True)
#+end_src

#+RESULTS:
:RESULTS:
# [goto error]
: 
: NameErrorTraceback (most recent call last)
: <ipython-input-15-ebad21c59879> in <module>()
: ----> 1 df = pd.read_csv("../data/politics-and-death/main-merged-data.csv")
:       2 # Convert 'year' variable to datetime format
:       3 df['year'] = df['year'].astype('str')
:       4 df['year'] = pd.to_datetime(df['year'], format='%Y')
:       5 # Set 'year' as index
: 
: NameError: name 'pd' is not defined
:END:
 
